/**
 * [입력 유효성 검사]
 *
 * 1. 올바르지 않은 형식의 이메일 입력했을 경우, '올바른 형태의 이메일을 입력하세요.'라는 Toast 메세지가 출력되어야 한다.
 * 2. 올바르지 않은 형식의 인증 코드를 입력했을 경우, '올바른 형태의 인증 코드를 입력하세요.'라는 Toast 메세지가 출력되어야 한다.
 * 3. 올바르지 않은 형식의 패스워드를 입력했을 경우, '올바른 형태의 비밀번호를 입력하세요.'라는 Toast 메세지가 출력되어야 한다.
 * 4. 일치하지 않는 확인 패스워드를 입력했을 경우, '패스워드가 일치하지 않습니다.'라는 Toast 메세지가 출력되어야 한다.
 *
 * [기능 테스트]
 *
 * 1. 존재하는 사용자 이메일 입력 후 다음 버튼을 누를 경우, 인증 코드를 입력하는 화면으로 넘어가야 한다.
 * 2. 존재하지 않는 사용자 이메일 입력 후 다음 버튼을 누를 경우, '해당 이메일이 존재하지 않습니다.' 라는 Toast 메세지가 출력되어야 한다.
 *
 * 3. 일치하는 인증 코드를 입력했을 경우, 새로운 패스워드를 입력하는 화면으로 넘어가야 한다.
 * 4. 일치하지 않는 인증 코드를 입력했을 경우, '코드를 다시 입력해주세요.' 라는 Toast 메세지가 출력되어야 한다.
 *
 * 5. 패스워드 확인까지 성공적으로 마친 후에는, 홈 화면으로 이동한 후 '비밀번호가 변경되었습니다.' 라는 Toast 메세지가 출력되어야 한다.
 *
 * + `email` 폼 요소가 수정될 경우, `recoveryCodeIsCorrect` 폼 요소가 `false` 상태로 변경되어야 한다.
 */
